Revit 2016 API
Plane Members
The Plane type exposes the following members.
Constructors
Name | Description
Plane()
 Default constructor
Plane(XYZ, XYZ)
 Construct a Plane object from a normal and an origin represented as XYZ objects. Follows the standard conventions for a planar surface. The constructed Plane object will pass through origin and be perpendicular to normal. The X and Y axes of the plane will be defined arbitrarily.
Plane(XYZ, XYZ, XYZ)
 Construct a Plane object from X and Y axes and an origin represented as XYZ objects. The plane passes through "origin" and is spanned by the basis vectors "xVec" and "yVec".
Methods
Name | Description
Dispose |  (Inherited from Surface.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Surface.)
Normal
 Plane normal.
Origin
 Plane origin.
XVec
 Axis defining the first parametric direction of the plane.
YVec
 Axis defining the second parametric direction of the plane.
See Also
Plane Class
Autodesk.Revit.DB Namespace